# ProcessIFCProject Method (IFCAnyHandle, IDictionary(IFCAnyHandle, ElementId)) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImporterIFC..::..ProcessIFCProject Method (IFCAnyHandle, IDictionary<(Of <(<'IFCAnyHandle, ElementId>)>)>)
ImporterIFC Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void ProcessIFCProject(
	IFCAnyHandle ifcProject,
	IDictionary<IFCAnyHandle, ElementId> createdElements
)
```

Visual Basic
---
```text
Public Sub ProcessIFCProject ( _
	ifcProject As IFCAnyHandle, _
	createdElements As IDictionary(Of IFCAnyHandle, ElementId) _
)
```

Visual C++
---
```text
public:
void ProcessIFCProject(
	IFCAnyHandle^ ifcProject,
	IDictionary<IFCAnyHandle^, ElementId^>^ createdElements
)
```

# ### Parameters
ifcProject
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle
createdElements
    Type: System.Collections.Generic..::..IDictionary<(Of <(<'IFCAnyHandle, ElementId>)>)>
# See Also
ImporterIFC Class
ProcessIFCProject Overload
Autodesk.Revit.DB.IFC Namespace